"""
Первые шаги: создаем аккаунт и свой первый репозиторий
Для начала нужно создать аккаунт на https://github.com.
Выберите имя пользователя, введите почту и пароль.
Лучше сразу подтвердить адрес электронной почты.

Время создать свой первый репозиторий — это место, где будет храниться ваш проект.

В правом верхнем углу рядом с аватаркой нажмите + и выберите "New repository".
Выберите имя для вашего репозитория. Лучше всего выбирать что-то осмысленное — чтобы через год легко было догадаться, что это и о чем. Например, "stepik — auto tests course".
Сформулируйте короткое описание для проекта. Здесь можно написать о том, что это домашние задания к курсу.
Выбираем Public (публичный) репозиторий: это означает, что любой сможет его найти и открыть.
Ставим галочку Initialize this repository with README.
Нажимаем кнопку Create repository.

"""